{ "name": "Schedules",
  "memberOf": "wix-bookings-backend",
  "mixes": [],
  "labels": [],
  "location":
    { "lineno": 1,
      "filename": "schedules.js" },
  "docs":
    { "summary": "The Resources API provides functionality for creating, managing, and querying schedules and sessions.",
      "description":
        [ "A schedule is a collection of sessions and the metadata to calculate availability. A schedule is owned by either a service or a resource as specified in the `scheduleOwnerId` property.",
          "",
          "Schedules contain metadata for the following areas:",
          "+ Availability",
          "+ Pricing",
          "+ Location",
          "+ Participants",
          "+ Conference calls",
          "",
          "Schedules are owned by either resources or services. Not all metadata is relevant to both.",
          "",
          "The schedule `availability` object holds the metadata to calculate availability. This is used in combination with sessions owned by the schedule to calculate available slots.",
          "",
          " The availability object contains an array of `linkedSchedules`. This array contains a list of other schedules that are impacted by this schedule’s availability. The `transparency` string defines how the linked schedules’ availability is affected. When `transparency` is set to `”FREE` the linked schedules’ availabilities are not affected when this schedule has a session. When set to `”BUSY”` the linked schedules have no available slots during this schedule’s sessions.",
          "For example, there are two services, math tutoring and science tutoring, and they are both offered by a tutor called John. In John’s resource’s schedule in the `liknedSchedules` array, we have both schedule IDs of the math service and the science service. ",
          "Both have transparency `”BUSY”`. When the math service is booked between 3 and 4pm, a session is created for John’s schedule for that time. The science service’s schedule is in John’s list of linked schedules. When availability is calculated for the science service, there will be no slots available between 3 and 4pm, because John is teaching math.",
          "",
          "Tags are used for grouping schedules and for specific functions in the Wix Bookings app. ",
          "The Wix Bookings app uses the following predefined tags to set schedule types for services: ",
          "`\"INDIVIDUAL\"`, `\"GROUP\"`, and `\"COURSE”` for appointments, classes and courses. Once the schedule type is set using these tags, you cannot update it.",
          "In addition to the app's tags, you can create and update tags for your own use.",
          "",
          "Some data defined in the **Settings** page is inherited by the schedule by default. Inherited fields are:",
          "+ location.businessLocation from the **Business Info** page. ",
          "+ availability.constraints.slotsSplitInterval from the **Appointment Time Slots** section in the **Bookings Policy** page",
          "The `inheritedFields` property lists the fields that were inherited from the **Business Info** page. ",
          "",
          "",
          "### Sessions",
          "A session is an occupied period of time on a schedule or period of availability on a resource's schedule.",
          "A session is owned by a schedule which in turn has an owner. The owner of a session's schedule can be a service or a resource.",
          "Sessions can be of type `\"AVAILABILITY\"` or `\"EVENT\"`. A session with type `\"AVAILABILITY\"` defines the availability of a resource. ",
          "A session with type `\"EVENT\"` creates an event on the calendar for the owner of the schedule that the session belongs to. ",
          "",
          "Session may be individual sessions or recurring sessions. ",
          "An individual session has a discrete start and end date. A recurring session defines a series of repeating sessions. ",
          "The recurrence is defined using a subset of [RRULE](https://icalendar.org/iCalendar-RFC-5545/3-3-10-recurrence-rule.html)s.",
          "",
          "The following RRULE parameters are supported:",
          "",
          "|Keyword|Description|Supported values|",
          "|--|--|---|",
          "|`FREQ`|The frequency at which the session is recurs. Required.|`WEEKLY`|",
          "|`INTERVAL`|How often, in terms of `FREQ`, the session recurs. Default is 1. Optional.|",
          "|`UNTIL`|The UTC end date and time of the recurrence. Optional.|",
          "|`BYDAY`|Days of the week when the event should recur. Required.|`MO`, `TU`, `WE`, `TH`, `FR`, `SA`, `SU`|",
          "",
          "For example, repeat every second week on a Monday until January 7, 2022 at 8 a.m.:",
          "`FREQ=WEEKLY;INTERVAL=2;BYDAY=MO;UNTIL=20220107T080000Z`",
          "",
          "A session includes an optional list of `affectedSchedules`. This is a list of linked schedules and the way each schedule's availability is affected. For example, the schedule of an instructor is linked to the session for the class that they instruct. ",
          "",
          "Sessions have tags that can be used to group sessions. Tags are also used by the Wix Bookings app. The tag `\"Blocked\"` is used to create a session that blocks the resource' availability but is not related to a service. Use this tag to schedule non-working hours where the resource is not available. The `\"Google_Event\"` tag is used by the app for events created by Google applications. These events are read-only.",
          "",
          "Sessions inherit information from the schedules that they belong to.",
          "The following lists which session properties are inherited from the schedule.",
          "",
          "+ `affectedSchedules`, from Schedule.availability.linkedSchedules",
          "+ `title`",
          "+ `tags`",
          "+ `location`",
          "+ `capacity`",
          "+ `rate`",
          "",
          "Inherited properties can be overridden for each session unless the session is a recurring session." ],
      "links": [],
      "examples": [],
      "extra":
        {  } },
  "properties": [],
  "operations": [],
  "callbacks": [],
  "messages": [],
  "extra":
    {  } }